#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

        name       = "view-client-icy"
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.KEYCLOAK_PROD.module.moh_applications.module.PLR-PRP.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_token_lifespan                     = "28800"
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "PLR-PRP"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "This service account is used for accessing the Provider and Location Registry (PLR) which is a standards-based repository of core provider data supplied by authorized sources that facilitates the formal exchange of health information."
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PLR-PRP.keycloak_openid_hardcoded_claim_protocol_mapper.orgId will be created
  + resource "keycloak_openid_hardcoded_claim_protocol_mapper" "orgId" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + add_to_userinfo     = true
      + claim_name          = "orgId"
      + claim_value         = "00026398"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "orgId"
      + realm_id            = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRP.keycloak_openid_hardcoded_claim_protocol_mapper.orgId will be updated in-place
  ~ resource "keycloak_openid_hardcoded_claim_protocol_mapper" "orgId" {
      ~ claim_value         = "00002855" -> "00026399"
        id                  = "275c2efb-a7da-48d0-b45a-408b734692f4"
        name                = "orgId"
        # (7 unchanged attributes hidden)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PLR-PRP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR/CONSUMER"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "fcbb38d1-a750-4718-97d9-eebacbf71d20"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PLR-PRP.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["default-roles-moh_applications"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "default-roles-moh_applications"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PLR-PRP.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR/CONSUMER"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "cecd3d4b-f68e-4c4a-a9c4-5a2db9aef8ee"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "CONSUMER"
      + service_account_user_id = (known after apply)
    }

Plan: 5 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*